src/DataProcessors/ГрупповаяОбработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ГрупповаяОбработка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВФоне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючФоновогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндикаторПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВременногоХранилищаДляВнутреннегоОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТихийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПерезаписыватьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьБазуПослеОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключатьСеансы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешатьМножественныйПодборОдногоЭлемента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыТестирования</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОпределениеУстанавливаемогоРелизаОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПараллельныхПроцессов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбработки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обработчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РелизОбновления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьРелизОбновления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКонфигураций</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиПерезаписыватьАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрыватьБазуПослеОбновления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтключатьСеансы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоОпределениеУстанавливаемогоРелизаОбновления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилаОбъединения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаОбъединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ГрупповаяОбработка/Ext/ManagerModule.bsl
&НаСервере
//
//
Функция ЗаполнитьЗначенияРезультатаВыбораПараметровОбработки(ОбъектОбработки, МассивПараметрыОбработки) Экспорт
	
	ТекущийВидГрупповойОбработки = Неопределено;
	РежимСценария = Ложь;
	
	Результат = Истина;
	Для Каждого ТекущийЭлементМассивПараметрыОбработки Из МассивПараметрыОбработки Цикл
		
		ЗаполнитьЗначенияСвойств(ОбъектОбработки, ТекущийЭлементМассивПараметрыОбработки);
		
		НоваяСтрокаОбъектСписок = ОбъектОбработки.Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОбъектСписок, ТекущийЭлементМассивПараметрыОбработки);
		НоваяСтрокаОбъектСписок.ВидКонфигурации = ТекущийЭлементМассивПараметрыОбработки.ИнформационнаяБаза.ВидКонфигурации;
		НоваяСтрокаОбъектСписок.РелизОбновления = ТекущийЭлементМассивПараметрыОбработки.ИнформационнаяБаза.РелизОбновления;
		
	КонецЦикла;
	
	ИсходнаяТаблица = ОбъектОбработки.Список.Выгрузить();		
	ИсходнаяТаблица.Свернуть("ВидОбработки");
	ОбъектОбработки.РежимСценария = (ИсходнаяТаблица.Количество() > 1);	
	ИсходнаяТаблица = Неопределено;
	
	ИсходнаяТаблица = ОбъектОбработки.Список.Выгрузить();
	ВременнаяТаблица = ИсходнаяТаблица.Скопировать();
	ВременнаяТаблица.Свернуть("ИнформационнаяБаза");	
	ОбъектОбработки.РазрешатьМножественныйПодборОдногоЭлемента = НЕ (ВременнаяТаблица.Количество() = ИсходнаяТаблица.Количество());
	ВременнаяТаблица = Неопределено;	
	ИсходнаяТаблица = Неопределено;
	
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция СформироватьРезультатВыбораПараметровОбработки(ОбъектОбработки) Экспорт
	
	Результат = Неопределено;
	
	Если ОбъектОбработки.Список.Количество() > 0 Тогда
		
		Результат = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из ОбъектОбработки.Список Цикл

			ПараметрыОбработки = ЗадачиНаСервере.ПолучитьСтруктуруПараметровОбработки(СтрокаТаблицы.ИнформационнаяБаза);	
			ПараметрыОбработки.Вставить("Обрабатывать", Ложь);
			ПараметрыОбработки.Вставить("УстановитьРелизОбновления", Справочники.РелизыОбновлений.ПустаяСсылка());
			ПараметрыОбработки.Вставить("КоличествоПараллельныхПроцессов", 1);
			ПараметрыОбработки.Вставить("КоличествоПараллельныхПроцессов", 1);
			ПараметрыОбработки.Вставить("АвтоОпределениеУстанавливаемогоРелизаОбновления", Ложь);			
			
			ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ОбъектОбработки);
			ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СтрокаТаблицы);
			
			Результат.Добавить(ПараметрыОбработки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
